DatosEstudianteAPI/app/controllers/estudiantes_controller.rb

  def index
    @estudiantes = Estudiante.all
---
SELECT `estudiantes`.* FROM `estudiantes`

  def create
    @estudiante = Estudiante.new(estudiante_params)

    if @estudiante.save
---
INSERT INTO `estudiantes` (`nombres`, `apellidos`, `carrera`, `carnet`, `created_at`, `updated_at`) VALUES ('Juan', 'Pérez', 'Ingeniería', '20240001', '2024-10-03 18:18:14.621147', '2024-10-03 18:18:14.621147') RETURNING `id`

  def update
    if @estudiante.update(estudiante_params)
---
UPDATE `estudiantes` SET `estudiantes`.`nombres` = 'Carlos', `estudiantes`.`apellidos` = 'López', `estudiantes`.`carrera` = 'Arquitectura', `estudiantes`.`updated_at` = '2024-10-03 18:22:08.315908' WHERE `estudiantes`.`id` = 1

  def destroy
    @estudiante.destroy!
---
DELETE FROM `estudiantes` WHERE `estudiantes`.`id` = 1

    def set_estudiante
      @estudiante = Estudiante.find(params[:id])
---
SELECT `estudiantes`.* FROM `estudiantes` WHERE `estudiantes`.`id` = 1 LIMIT 1